Tekla Open API Reference for Tekla Structures 2025
DrawingCreator.CreateDrawings Method (AutoDrawingRule, Identifier)
 Creates drawings using the AutoDrawing tool of Tekla Structures.
 Namespace: Tekla.Structures.Drawing.Automation
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool CreateDrawings(
	AutoDrawingRule Rule,
	Identifier ModelObjectIdentifier
)
Public Shared Function CreateDrawings (
	Rule As AutoDrawingRule,
	ModelObjectIdentifier As Identifier
) As Boolean
Parameters
Rule
Type: Tekla.Structures.Drawing.Automation.AutoDrawingRule
The AutoDrawing rule to be used.
ModelObjectIdentifier
Type: Tekla.Structures.Identifier
The model object identifier to be used. Part identifier to create single part drawing or assembly identifier to create assembly drawing.
Return Value
Type: Boolean
True on success.
See Also
Reference
DrawingCreator Class
CreateDrawings Overload
Tekla.Structures.Drawing.Automation Namespace